---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralConnectionCodeCheckingStatus
source: html/2a3407fe-c718-820f-448a-f29b5bee6d5d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralConnectionCodeCheckingStatus Property

"Code Checking Status"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralConnectionCodeCheckingStatus { get; }
```